Load-test/all-e2e-scenarios.yml
config:
  target: "https://convoa-1.taild6271e.ts.net"
  phases:
    # Warm-up phase
    - duration: 120
      arrivalRate: 3
      name: "Warm-up - All E2E Scenarios"
    # Gradual ramp-up
    - duration: 180
      arrivalRate: 8
      name: "Ramp-up"
    # Steady load phase
    - duration: 600
      arrivalRate: 12
      name: "Steady Load - All E2E Test Cases"
    # Peak load phase
    - duration: 300
      arrivalRate: 20
      name: "Peak Load"
    # Cool-down phase
    - duration: 120
      arrivalRate: 3
      name: "Cool-down"

  http:
    timeout: 90
    pool: 100
    keepAlive: true

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  # Test data covering all scenarios
  variables:
    primaryTestUsers:
      - "testerdrew7@yopmail.com"
    # secondaryTestUsers:
    #   - "loadtest1@yopmail.com"
    #   - "loadtest2@yopmail.com"
    #   - "loadtest3@yopmail.com"
    testPasswords:
      - "Test12345@"
      # - "LoadTest123@"
    # companyNames:
    #   - "Acme Corp"
    #   - "Tech Solutions Inc"
    #   - "Digital Services LLC"
    #   - "Innovation Hub"
    # phoneNumbers:
    #   - "+12345678901"
    #   - "+19876543210"
    #   - "+15551234567"

scenarios:
  # 1. Complete Signup Journey (1-Test-Sign-up.spec.js) - COMMENTED OUT
  # - name: "Complete Signup Journey"
  #   weight: 8
  #   flow:
  #     - get:
  #         url: "/signup"
  #         expect:
  #           - statusCode: 200
  #         capture:
  #           - header: "set-cookie"
  #             as: "sessionCookie"

  #     - think: 2

  #     # Multi-step signup process simulation
  #     - post:
  #         url: "/api/v1/auth/sign-up"
  #         headers:
  #           Content-Type: "application/json"
  #           Cookie: "{{ sessionCookie }}"
  #         json:
  #           name: "LoadTest User{{ $randomInt(1, 10000) }}"
  #           email: "loadtest{{ $randomInt(10000, 99999) }}@yopmail.com"
  #           password: "{{ testPasswords }}"
  #           recaptcha_token: "test_token"
  #           company:
  #             name: "{{ companyNames }} {{ $randomInt(1, 999) }}"
  #             phone: "{{ phoneNumbers }}"
  #             type: "Technology"
  #             country: "United States"
  #             country_code: "US"
  #             state: "California"
  #             city: "San Francisco"
  #             address: "{{ $randomInt(1, 999) }} Test St, Load City"
  #             website_url: "https://company{{ $randomInt(1, 1000) }}.com"
  #         expect:
  #           - statusCode: [200, 201, 400, 409]

  # 2. Full Login and Navigation (2-Test-Sign-In.spec.js)
  - name: "Login and Navigation Flow"
    weight: 28
    flow:
      - get:
          url: "/login"
          expect:
            - statusCode: 200
          capture:
            - header: "set-cookie"
              as: "sessionCookie"

      - think: 2

      - post:
          url: "/api/v1/auth/sign-in"
          headers:
            Cookie: "{{ sessionCookie }}"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
              ifUndefined: "skip"

      - think: 1

      # Dashboard navigation
      - get:
          url: "/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Cookie: "{{ sessionCookie }}"
          expect:
            - statusCode: [200, 500]

      - think: 2

      # User profile and settings
      - get:
          url: "/api/v1/user/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

  # 3. Dashboard Comprehensive Testing (3-Test-Dashboard.spec.js)
  - name: "Dashboard Comprehensive Flow"
    weight: 15
    flow:
      # Login
      - post:
          url: "/api/v1/auth/sign-in"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"

      # Dashboard access
      - get:
          url: "/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

      - think: 2

      # Dashboard data endpoints
      - get:
          url: "/api/v1/dashboard/call-count-by-category"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/dashboard/call-volume-by-hour"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 400, 401, 404]

      - get:
          url: "/api/v1/dashboard/call-volume-per-day"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - think: 1

      # Navigate to other sections
      - get:
          url: "/conversations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 500]

      - get:
          url: "/services"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # 4. Conversation Management (4-Test-Conversation.spec.js)
  - name: "Conversation Management Flow"
    weight: 12
    flow:
      # Login
      - post:
          url: "/api/v1/auth/sign-in"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"

      # Conversations page
      - get:
          url: "/conversation"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

      - think: 2

      # Fetch conversations data
      - get:
          url: "/api/v1/voice/calls/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]
          capture:
            - json: "$[0].id"
              as: "conversationId"
              ifUndefined: "skip"

      # Get specific conversation
      - get:
          url: "/api/v1/voice/calls/messages/{{ conversationId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]
          ifTrue: "conversationId"

      # Search and analytics (using existing endpoints)
      - get:
          url: "/api/v1/dashboard/call-count-by-category"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

  # 5. Services and File Management (5-Test-Services.spec.js)
  - name: "Services and File Management"
    weight: 10
    flow:
      # Login
      - post:
          url: "/api/v1/auth/sign-in"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"

      # Services page
      - get:
          url: "/services"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 500]

      - think: 3

      # Services data
      - get:
          url: "/api/v1/voice/files/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/voice/assistants/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

  # 6. Assistant Configuration (6-Test-Assistant.spec.js)
  - name: "Assistant Configuration Flow"
    weight: 15
    flow:
      # Login
      - post:
          url: "/api/v1/auth/sign-in"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"

      # Assistant page
      - get:
          url: "/assistants"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

      - think: 3

      # Assistant configuration
      - get:
          url: "/api/v1/voice/assistants/stats"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/voice/predefined-voices/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/voice/predefined-roles/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/voice/predefined-tools/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

  # 7. Outbound Campaigns (7-Test-Outbounds.spec.js)
  - name: "Outbound Campaigns Flow"
    weight: 8
    flow:
      # Login
      - post:
          url: "/api/v1/auth/sign-in"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"

      # Outbounds page
      - get:
          url: "/outbounds"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 500]

      - think: 2

      # Outbound-related endpoints
      - get:
          url: "/api/v1/voice/phone-numbers/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/voice/call-transfer/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

  # 8. Company Profile Management (8-Test-Company.spec.js)
  - name: "Company Profile Management"
    weight: 7
    flow:
      # Login
      - post:
          url: "/api/v1/auth/sign-in"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"

      # Company page
      - get:
          url: "/company"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

      - think: 2

      # Company profile data
      - get:
          url: "/api/v1/companies/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/utilities/company-types"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/v1/utilities/countries"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

  # 9. Settings and Preferences (9-Test-Settings.spec.js)
  - name: "Settings and Preferences Flow"
    weight: 5
    flow:
      # Login
      - post:
          url: "/api/v1/auth/sign-in"
          form:
            username: "{{ primaryTestUsers }}"
            password: "{{ testPasswords }}"
          expect:
            - statusCode: [200, 400, 401]
          capture:
            - json: "$.access_token"
              as: "authToken"

      # Settings page
      - get:
          url: "/settings"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

      - think: 2

      # User settings
      - get:
          url: "/api/v1/user/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]

      - get:
          url: "/api/v1/billing-consumption/"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 404]

      # Payment/billing page
      - get:
          url: "/payment"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]